РасширениеГТС/Джитиис/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютнаяОтгрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютныйСчетВРубли</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВариантОбеспечения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РасширениеГТС/Джитиис/Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаВСтранахЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаЧерезПодотчетноеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриемНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщикаРеглУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаПоИмпорту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеОплатыОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствИзДругойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИнкассацияДенежныхСредствИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВнутренняяПередачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПрочееПоступлениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствИзДругойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствИзКассыККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствПоЗаймамВыданным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПогашениеЗаймаСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонвертацияВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратДенежныхСредствОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратДенежныхСредствОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратДенежныхСредствОтДругойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеречислениеВБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратДенежныхСредствВДругуюОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеречислениеТаможне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплатаДенежныхСредствВДругуюОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатаЗарплатыПоЗарплатномуПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатаЗарплатыНаЛицевыеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеречислениеДенежныхСредствНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СнятиеНаличныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплатаПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеречислениеНаДепозиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаЗаймов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаЗаймаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПрочаяВыдачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеТоваровМеждуФилиалами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщикаФактуровкаПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаПоИмпортуТоварыВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщикаТоварыВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаВСтранахЕАЭСТоварыВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаВСтранахЕАЭСФактуровкаПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриемНаХранениеСПравомПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияБезПереходаПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаНаХранениеСПравомПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратНеперечисленнойЗарплатыПоЗарплатномуПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеОплатыПоПлатежнойКарте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствСДругогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствПоДепозитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратНеперечисленныхДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СборкаТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазборкаТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияЧерезКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияЧерезКомиссионераБезПереходаПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияКлиентуРеглУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереходПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОформлениеГТДБрокером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОформлениеГТДСамостоятельно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратДенежныхСредствОтАрендодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратНалогов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

РасширениеГТС/Джитиис/Documents/ЗаказКлиента/Ext/ObjectModule.bsl
&После("ОбработкаПроведения")
Процедура асп_ОбработкаПроведения(Отказ, РежимПроведения)
	//ASP_Lebedev_000020332_17/08/2023 Принудительная регистрация в узле обмена.
	ДатаКонтроля = Константы.ДатаКонтроляВыгрузкиДокументовВБП.Получить();
	ОбъектМодифицирован = ASP_Добавленный.СравнитьВерсииОбъекта(ЭтотОбъект); //000026792
	Если НЕ Отказ и ЭтотОбъект.Проведен и ЭтотОбъект.Дата > ДатаКонтроля и ОбъектМодифицирован Тогда         
		узел = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятия30.НайтиПоКоду("002");
		ПланыОбмена.ЗарегистрироватьИзменения(узел, ЭтотОбъект);
	КонецЕсли;
	
	//++ASP_Crow 30.09.2024 000024647 Создаем запись по обеспечению заказа, она всегда одна но обновляется
	Если НЕ ДополнительныеСвойства.Свойство("ASP_ВнешнийДокумент") и НЕ Отказ и ЭтотОбъект.Проведен Тогда
		//+++ASP Колчаев 14.01.2026 Если запись в регистр провести не удалось, то запись док-а отменяется
		Если ASP_ДобавитьЗаписьСтатусаОбеспечения() = Истина Тогда
			Отказ = Истина;
		КонецЕсли;
		//---ASP Колчаев 14.01.2026 Если запись в регистр провести не удалось, то запись док-а отменяется
	КонецЕсли;
	//--ASP_Crow 30.09.2024 000024647

КонецПроцедуры

Функция ASP_ДобавитьЗаписьСтатусаОбеспечения()
	//---ASP Колчаев 14.01.2026 Добавлена попытка для записи в регистр
	Попытка
		НаборЗаписей = РегистрыСведений.ASP_СостояниеОбеспеченияЗаказов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заказ.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		
		НеТребуетОбеспечения = Истина;
		Для каждого СтрТов из Товары Цикл
			Если СтрТов.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется
				или СтрТов.Отменено тогда
				Продолжить
			Иначе
				НеТребуетОбеспечения = ложь;	
			КонецЕсли;	
		КонецЦикла;
		//++ASP_Коваленко 24.10.24 000024974 Проверка что всё отгружено
		ВсёОтгружено = Истина;
		Для каждого СтрТов из Товары Цикл
			Если СтрТов.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить или СтрТов.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда 
				Продолжить
			Иначе
				ВсёОтгружено = ложь;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		//--ASP_Коваленко 24.10.24 000024974
		
		//++ASP_Коваленко 24.10.24 000024974 неучитываемый массив номенклатур
		МассивЗапретРезервирования = Склад.ASP_Номенклатура.Выгрузить().ВыгрузитьКолонку("Номенклатура");
		//--ASP_Коваленко 24.10.24 000024974
		
		#Область СтарыйКод
		//Запрос = новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	&Заказ КАК Ссылка,
		//               |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		//               |	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		//               |	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
		//			   |	ЗаказКлиентаТовары.Сумма как Сумма
		//               |ПОМЕСТИТЬ ВТ_ДанныеЗаказа
		//               |ИЗ
		//               |	&Товары КАК ЗаказКлиентаТовары
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |ВЫБРАТЬ
		//               |	ЗаказКлиентаТовары.Ссылка КАК Заказ,
		//               |	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок) КАК КоличествоВсего,
		//               |	0 КАК КоличествоОбеспечено,
		//			   |	Сумма(ЗаказКлиентаТовары.Сумма) Как СуммаВсего,
		//			   |	0 Как СуммаОбеспечено
		//               |ПОМЕСТИТЬ Вт_ВсегоПоЗаказу
		//               |ИЗ
		//               |	ВТ_ДанныеЗаказа КАК ЗаказКлиентаТовары
		//               |ГДЕ
		//               |	ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры <> &ТипНоменклатуры
		//			   |
		//               |СГРУППИРОВАТЬ ПО
		//               |	ЗаказКлиентаТовары.Ссылка
		//               |
		//               |ОБЪЕДИНИТЬ ВСЕ
		//               |
		//               |ВЫБРАТЬ
		//               |	ЗаказКлиентаТовары.Ссылка,
		//               |	0,
		//               |	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок),
		//			   |	0,
		//			   |	Сумма(ЗаказКлиентаТовары.Сумма)
		//               |ИЗ
		//               |	ВТ_ДанныеЗаказа КАК ЗаказКлиентаТовары
		//               |ГДЕ
		//               |	ЗаказКлиентаТовары.ВариантОбеспечения В(&СтатусОбеспечено)
		//               |	И ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры <> &ТипНоменклатуры
		//               |
		//               |СГРУППИРОВАТЬ ПО
		//               |	ЗаказКлиентаТовары.Ссылка
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |ВЫБРАТЬ
		//               |	Вт_ВсегоПоЗаказу.Заказ КАК Заказ,
		//               |	СУММА(Вт_ВсегоПоЗаказу.КоличествоВсего) КАК КоличествоВсего,
		//               |	СУММА(Вт_ВсегоПоЗаказу.КоличествоОбеспечено) КАК КоличествоОбеспечено,
		//			   |	СУММА(Вт_ВсегоПоЗаказу.СуммаВсего) КАК СуммаВсего,
		//			   |	СУММА(Вт_ВсегоПоЗаказу.СуммаОбеспечено) КАК СуммаОбеспечено
		//               |ПОМЕСТИТЬ ВТ_ЗаказыГруппировка
		//               |ИЗ
		//               |	Вт_ВсегоПоЗаказу КАК Вт_ВсегоПоЗаказу
		//               |
		//               |СГРУППИРОВАТЬ ПО
		//               |	Вт_ВсегоПоЗаказу.Заказ
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |ВЫБРАТЬ
		//               |	ВТ_ЗаказыГруппировка.Заказ КАК Заказ,
		//               |	СУММА(ВЫБОР
		//               |			КОГДА ВТ_ЗаказыГруппировка.КоличествоОбеспечено = 0
		//               |					ИЛИ ВТ_ЗаказыГруппировка.КоличествоОбеспечено ЕСТЬ NULL
		//               |				ТОГДА 0
		//               |			КОГДА ВТ_ЗаказыГруппировка.КоличествоОбеспечено = ВТ_ЗаказыГруппировка.КоличествоВсего
		//               |				ТОГДА 100
		//               |			ИНАЧЕ 100 * ВТ_ЗаказыГруппировка.КоличествоОбеспечено / ВТ_ЗаказыГруппировка.КоличествоВсего
		//               |		КОНЕЦ) КАК ПроцентОбеспечения,
		//			   |	СУММА(ВЫБОР
		//               |			КОГДА ВТ_ЗаказыГруппировка.СуммаОбеспечено = 0
		//               |					ИЛИ ВТ_ЗаказыГруппировка.СуммаОбеспечено ЕСТЬ NULL
		//               |				ТОГДА 0
		//               |			КОГДА ВТ_ЗаказыГруппировка.СуммаОбеспечено = ВТ_ЗаказыГруппировка.СуммаВсего
		//               |				ТОГДА 100
		//               |			ИНАЧЕ 100 * ВТ_ЗаказыГруппировка.СуммаОбеспечено / ВТ_ЗаказыГруппировка.СуммаВсего
		//               |		КОНЕЦ) КАК ПроцентПоСумме
		//               |ИЗ
		//               |	ВТ_ЗаказыГруппировка КАК ВТ_ЗаказыГруппировка
		//               |
		//               |СГРУППИРОВАТЬ ПО
		//               |	ВТ_ЗаказыГруппировка.Заказ";
		//Запрос.УстановитьПараметр("Товары", Товары);
		//МассивВарОбеспечения = новый Массив;
		//МассивВарОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.Отгрузить);
		//МассивВарОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.СоСклада);
		//Запрос.УстановитьПараметр("СтатусОбеспечено", МассивВарОбеспечения);
		//Запрос.УстановитьПараметр("Заказ", Ссылка);
		//Запрос.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Услуга);
		//Рез = Запрос.Выполнить().Выгрузить();
		#КонецОбласти
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	&Заказ КАК Ссылка,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
		|	ЗаказКлиентаТовары.Сумма как Сумма
		|ПОМЕСТИТЬ ВТ_ДанныеЗаказа
		|ИЗ
		|	&Товары КАК ЗаказКлиентаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
		|	ЗаказКлиентаТовары.Сумма как Сумма
		|ПОМЕСТИТЬ ВТ_ДанныеЗаказаПослеВыгр
		|ИЗ
		|	ВТ_ДанныеЗаказа КАК ЗаказКлиентаТовары
		|ГДЕ
		|	НЕ ЗаказКлиентаТовары.Номенклатура В (&МассивЗапретРезервирования)
		|	И ЗаказКлиентатовары.ВариантОбеспечения <> &НеОбеспечивать
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка КАК Заказ,
		|	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок) КАК КоличествоВсего,
		|	0 КАК КоличествоОбеспечено,
		|	Сумма(ЗаказКлиентаТовары.Сумма) Как СуммаВсего,
		|	0 Как СуммаОбеспечено
		|ПОМЕСТИТЬ Вт_ВсегоПоЗаказу
		|ИЗ
		|	ВТ_ДанныеЗаказаПослеВыгр КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры <> &ТипНоменклатуры 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка,
		|	0,
		|	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок),
		|	0,
		|	Сумма(ЗаказКлиентаТовары.Сумма)
		|ИЗ
		|	ВТ_ДанныеЗаказаПослеВыгр КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.ВариантОбеспечения В(&СтатусОбеспечено)
		|	И ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры <> &ТипНоменклатуры
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_ВсегоПоЗаказу.Заказ КАК Заказ,
		|	СУММА(Вт_ВсегоПоЗаказу.КоличествоВсего) КАК КоличествоВсего,
		|	СУММА(Вт_ВсегоПоЗаказу.КоличествоОбеспечено) КАК КоличествоОбеспечено,
		|	СУММА(Вт_ВсегоПоЗаказу.СуммаВсего) КАК СуммаВсего,
		|	СУММА(Вт_ВсегоПоЗаказу.СуммаОбеспечено) КАК СуммаОбеспечено
		|ПОМЕСТИТЬ ВТ_ЗаказыГруппировка
		|ИЗ
		|	Вт_ВсегоПоЗаказу КАК Вт_ВсегоПоЗаказу
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт_ВсегоПоЗаказу.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказыГруппировка.Заказ КАК Заказ,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_ЗаказыГруппировка.КоличествоОбеспечено = 0
		|					ИЛИ ВТ_ЗаказыГруппировка.КоличествоОбеспечено ЕСТЬ NULL
		|				ТОГДА 0
		|			КОГДА ВТ_ЗаказыГруппировка.КоличествоОбеспечено = ВТ_ЗаказыГруппировка.КоличествоВсего
		|				ТОГДА 100
		|			ИНАЧЕ 100 * ВТ_ЗаказыГруппировка.КоличествоОбеспечено / ВТ_ЗаказыГруппировка.КоличествоВсего
		|		КОНЕЦ) КАК ПроцентОбеспечения,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_ЗаказыГруппировка.СуммаОбеспечено = 0
		|					ИЛИ ВТ_ЗаказыГруппировка.СуммаОбеспечено ЕСТЬ NULL
		|				ТОГДА 0
		|			КОГДА ВТ_ЗаказыГруппировка.СуммаОбеспечено = ВТ_ЗаказыГруппировка.СуммаВсего
		|				ТОГДА 100
		|			ИНАЧЕ 100 * ВТ_ЗаказыГруппировка.СуммаОбеспечено / ВТ_ЗаказыГруппировка.СуммаВсего
		|		КОНЕЦ) КАК ПроцентПоСумме
		|ИЗ
		|	ВТ_ЗаказыГруппировка КАК ВТ_ЗаказыГруппировка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗаказыГруппировка.Заказ";
		Запрос.УстановитьПараметр("Товары", Товары);
		МассивВарОбеспечения = новый Массив;
		МассивВарОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.Отгрузить);
		МассивВарОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.СоСклада);
		Запрос.УстановитьПараметр("СтатусОбеспечено", МассивВарОбеспечения);
		Запрос.УстановитьПараметр("Заказ", Ссылка);            
		Запрос.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Услуга);
		Запрос.УстановитьПараметр("МассивЗапретРезервирования",МассивЗапретРезервирования);
		Запрос.УстановитьПараметр("НеОбеспечивать", Перечисления.ВариантыОбеспечения.НеТребуется);
		Рез = Запрос.Выполнить().Выгрузить();
		
		НаборЗаписей = Регистрысведений.ASP_СостояниеОбеспеченияЗаказов.СоздатьНаборЗаписей();
		
		Для каждого СтрРез из Рез Цикл
			СоздатьНапоминание = Ложь;
			НаборЗаписей.Отбор.Заказ.Установить(СтрРез.Заказ);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда //Может возникнуть ситуация, что старый заказ обеспечивается
				СтрокаЗаписи = НаборЗаписей.Добавить();
				СтрокаЗаписи.Заказ = СтрРез.Заказ;
				СтрокаЗАписи.ПроцентОбеспечения = СтрРез.ПроцентПоСумме;
				Если НеТребуетОбеспечения Тогда
					СтрокаЗаписи.СтатусОбеспечения = Перечисления.ASP_СтатусыОбеспеченияЗаказа.НеТребуетОбеспечения;	
				ИначеЕсли СтрРез.ПроцентОбеспечения = 100 Тогда
					Если НЕ ЗначениеЗаполнено(СтрокаЗаписи.ДатаПолногоОбеспечения) Тогда
						СтрокаЗаписи.ДатаПолногоОбеспечения = ТекущаяДата();                             
						СоздатьНапоминание = Истина;
					КонецЕсли;
					СтрокаЗаписи.СтатусОбеспечения = Перечисления.ASP_СтатусыОбеспеченияЗаказа.Обеспечен;
				Иначе
					СтрокаЗаписи.СтатусОбеспечения = Перечисления.ASP_СтатусыОбеспеченияЗаказа.НеОбеспечен;
				КонецЕсли;	
			Иначе //В остальном запись всегда 1 и она перезаписывается
				СтрокаЗаписи = НаборЗаписей[0];
				СтрокаЗаписи.Заказ = СтрРез.Заказ;
				СтрокаЗАписи.ПроцентОбеспечения = СтрРез.ПроцентПоСумме;
				Если НеТребуетОбеспечения Тогда
					СтрокаЗаписи.СтатусОбеспечения = Перечисления.ASP_СтатусыОбеспеченияЗаказа.НеТребуетОбеспечения;	
				ИначеЕсли СтрРез.ПроцентОбеспечения = 100 Тогда
					Если НЕ ЗначениеЗаполнено(СтрокаЗаписи.ДатаПолногоОбеспечения) Тогда
						СтрокаЗаписи.ДатаПолногоОбеспечения = ТекущаяДата();
						СоздатьНапоминание = Истина;
					КонецЕсли;
					СтрокаЗаписи.СтатусОбеспечения = Перечисления.ASP_СтатусыОбеспеченияЗаказа.Обеспечен;
				Иначе
					СтрокаЗаписи.СтатусОбеспечения = Перечисления.ASP_СтатусыОбеспеченияЗаказа.НеОбеспечен;
				КонецЕсли;	
			КонецЕсли;
			
			//++ASP_Коваленко 24.10.24 000024974  если все отгружено, то не создаем напоминание
			Если ВсёОтгружено Тогда 
				СоздатьНапоминание = ложь;			
			КонецЕсли;
			//--ASP_Коваленко 24.10.24 000024974
			
			Если СоздатьНапоминание и Пользователи.ТекущийПользователь() <> Ссылка.Менеджер Тогда
				//Если СоздатьНапоминание Тогда
				
				ТекстНапоминания = Строка(Ссылка) + " был полностью обеспечен" + Формат(СтрокаЗаписи.ДатаПолногоОбеспечения, "ДФ=dd.MM.yyyy")
				+ Символы.ПС + "Контрагент: " + Ссылка.Контрагент
				+ Символы.ПС + "Общая сумма заказа: " + Ссылка.СуммаДокумента;
				НапоминанияПользователяСлужебный.ASP_ПодключитьПроизвольноеНапоминание(Ссылка.Менеджер,ТекстНапоминания, ТекущаяДата(),,Ссылка);
				НастройкиОтпр = новый структура;
				НастройкиОтпр.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка());
				НастройкиОтпр.Вставить("Тема", "Уведомление о полном обеспечении заказа №" + Ссылка.Номер);
				НастройкиОтпр.Вставить("Тело", ТекстНапоминания);
				ASP_ОтправитьПочтовоеПисьмо(Ссылка, НастройкиОтпр);
			КонецЕсли;
			
			НаборЗаписей.Записать();
		КонецЦикла;
	Исключение
		Сообщить("Не удалось записать в регистр, данные не сохранены");
		Возврат Истина;
	КонецПопытки;
	//---ASP Колчаев 14.01.2026 Добавлена попытка для записи в регистр
	
КонецФункции   

Процедура ASP_ОтправитьПочтовоеПисьмо(ЗаказКлиента, Настройки)
    Адресат = Ссылка.Менеджер;
		
	Если НЕ Настройки.УчетнаяЗапись.Пустая() Тогда
		УчетнаяЗапись = Настройки.УчетнаяЗапись;
	Иначе
		УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	КонецЕсли;
	
	Если НЕ РаботаСПочтовымиСообщениями.УчетнаяЗаписьНастроена(УчетнаяЗапись) Тогда
		
		Комментарий = "Не удалось отправить электронное письмо - не настроена учетная запись электронной почты";
		ЗаписьЖурналаРегистрации("Уведомление об оплате заказа", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЗаказКлиента, ЗаказКлиента, Комментарий);
		Возврат;
		
	КонецЕсли;
	
	Попытка
		
		ПараметрыОтправки = Новый Структура;
		стрАдреса = "";
				
		АдресПочты = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Адресат, Справочники.ВидыКонтактнойИнформации.EmailПользователя);
		Если НЕ ПустаяСтрока(АдресПочты) Тогда
			стрАдреса = стрАдреса + АдресПочты + ";";
		КонецЕсли;
		
		
		
		Если ПустаяСтрока(стрАдреса) Тогда
			
			Комментарий = "Не найдены адреса получателей";
			ЗаписьЖурналаРегистрации("Уведомление об оплате заказа", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЗаказКлиента, ЗаказКлиента, Комментарий);	
			Возврат;
			
		Иначе
			СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(стрАдреса);
		КонецЕсли;
		
		ПараметрыОтправки.Вставить("Кому", стрАдреса);
		ПараметрыОтправки.Вставить("Тема", Настройки.Тема);
		ПараметрыОтправки.Вставить("Тело", Настройки.Тело);
		ПараметрыОтправки.Вставить("ТипТекста", ТипТекстаПочтовогоСообщения.ПростойТекст);
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыОтправки);
		
	Исключение
		
		Комментарий = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Уведомление об оплате заказа", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЗаказКлиента, ЗаказКлиента, Комментарий);	
		
	КонецПопытки;	
	
КонецПроцедуры

&ИзменениеИКонтроль("ПередЗаписью")
Процедура асп_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

#Вставка
// Здесь можно описать новое поведение.
	//++ASP_Crow 11.03.2026 000029567 в расширение
	//Альтер ЛОГО  
	Если Не ЗначениеЗаполнено(Сделка) И Дата >= '20120409000000' И ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика Тогда
		Сообщить("Не заполнено поле ""Сделка""");	
		Отказ = Истина;
	КонецЕсли;	
	//Альтер ЛОГО 

	//ГТС 
	ПроверитьЦенуПродажи(Товары)  ;
	ASP_ПрослеживаемыйТовар();
	//--ASP_Crow 11.03.2026 000029567 в расширение

#КонецВставки

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	Если ЭтоНовый() И Не ЭтоЗаказКакСчет Тогда 
		// если ЭтоЗаказКакСчет = Истина - тогда реквизит был заполнен ранее в форме – изменять не требуется
		ЭтоЗаказКакСчет  = Не ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
	КонецЕсли;

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ЭтоЗаказКакСчет И Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда

		ТекстОшибки = НСтр("ru = 'Заказ как счет должен иметь статус ""На согласовании"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, , , Отказ);

	КонецЕсли;

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах")
		И Не СкидкиРассчитаны
		И ПродажиСервер.ОперацииПередачиТоваров().Найти(ХозяйственнаяОперация) = Неопределено Тогда

		Отказ = Истина;

		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'В документе %1 не рассчитаны автоматические скидки (наценки). Проведение невозможно. Для расчёта автоматических скидок (наценок) проведите документ из формы документа.'"),
		Ссылка);

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		Ссылка,
		,
		,
		Отказ);

	КонецЕсли;

	НоменклатураСервер.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи);

	ЗаказыСервер.УстановитьКлючВСтрокахТабличнойЧасти(ЭтотОбъект, "Товары");

	ОперацииПередачи = ПродажиСервер.ОперацииПередачиТоваров();

	РеквизитыСоглашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соглашение, "КомиссионныеПродажи25, ХозяйственнаяОперация");
	КомиссионныеПродажи25 = ?(ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
	И (НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами")
	ИЛИ (ЗначениеЗаполнено(Соглашение)
	И РеквизитыСоглашения.КомиссионныеПродажи25
	И РеквизитыСоглашения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию)), Истина, Ложь);

	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала Тогда
		ВернутьМногооборотнуюТару = Ложь;
		ТребуетсяЗалогЗаТару      = Ложь;

	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
		И КомиссионныеПродажи25 Тогда
		ВернутьМногооборотнуюТару      = Ложь;
		СрокВозвратаМногооборотнойТары = 0;
		ТребуетсяЗалогЗаТару           = Ложь;
	КонецЕсли;

	Если (ОперацииПередачи.Найти(ХозяйственнаяОперация) <> Неопределено
		Или Не ВернутьМногооборотнуюТару)
		И ТребуетсяЗалогЗаТару Тогда

		ТребуетсяЗалогЗаТару = Ложь;

	КонецЕсли;

	СуммаДокумента = ПолучитьСуммуЗаказанныхСтрок();
	СуммаВозвратнойТары = ПолучитьСуммуВозвратнойТары();

	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;

	ДокументСогласован = Согласован;

	ОбщегоНазначенияУТ.ИзменитьПризнакСогласованностиДокумента(
	ЭтотОбъект,
	РежимЗаписи,
	Перечисления.СтатусыЗаказовКлиентов.НеСогласован);

	// Установим дату согласования, если документ согласован
	Если Не ДокументСогласован И Согласован Тогда
		ДатаСогласования = ТекущаяДатаСеанса();
		ВзаиморасчетыСервер.ПриИзмененииДатыСогласования(ЭтотОбъект);
	КонецЕсли;

	ИдентификаторПлатежа = ОбщегоНазначенияУТ.ПолучитьУникальныйИдентификаторПлатежа(ЭтотОбъект);

	ВзаиморасчетыСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи);

	ГрафикИсполненияВДоговоре = Ложь;
	Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
		И ЗначениеЗаполнено(Договор) Тогда
		ГрафикИсполненияВДоговоре = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ЗаданГрафикИсполнения");
	КонецЕсли;

	Если ОперацииПередачи.Найти(ХозяйственнаяОперация) <> Неопределено
		Или ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным
		Или ГрафикИсполненияВДоговоре Тогда

		СуммаАвансаДоОбеспечения = 0;
		СуммаПредоплатыДоОтгрузки = 0;

	Иначе

		ПродажиСервер.ЗаполнитьСуммыАвансаПредоплаты(ЭтотОбъект);

	КонецЕсли;

	Если Не НеОтгружатьЧастями Тогда
		НоваяДатаОтгрузки = Дата(1,1,1);

		Если Товары.Количество() > 0 Тогда

			Если Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению
				ИЛИ Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке
				ИЛИ Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда

				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Отменено", Ложь);
				СтрокиКОбеспечению = Товары.НайтиСтроки(ПараметрыОтбора);

				Если СтрокиКОбеспечению.Количество() > 0 Тогда

					ТаблицаСтрокКОбеспечению = Товары.Выгрузить(СтрокиКОбеспечению, "ДатаОтгрузки");
					ТаблицаСтрокКОбеспечению.Сортировать("ДатаОтгрузки Возр");
					НоваяДатаОтгрузки = ТаблицаСтрокКОбеспечению[0].ДатаОтгрузки;

				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

		ДатаОтгрузки = НоваяДатаОтгрузки;
	Иначе
		ОбеспечениеВДокументахСервер.ЗаполнитьДатыОтгрузкиВТаблице(ДатаОтгрузки, Товары, "ДатаОтгрузки");
	КонецЕсли;

	// Очистим реквизиты документа не используемые для хозяйственной операции.
	МассивВсехРеквизитов = Новый Массив;
	МассивРеквизитовОперации = Новый Массив;
	Документы.ЗаказКлиента.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
	ХозяйственнаяОперация,
	МассивВсехРеквизитов,
	МассивРеквизитовОперации);
	ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизиты(
	ЭтотОбъект,
	МассивВсехРеквизитов,
	МассивРеквизитовОперации);

	МассивРеквизитов = Новый Массив;
	Если ЗначениеЗаполнено(ФормаОплаты) И Не (ФормаОплаты = Перечисления.ФормыОплаты.Наличная) Тогда
		МассивРеквизитов.Добавить("Касса");
	КонецЕсли;

	ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизиты(ЭтотОбъект, МассивРеквизитов, Новый Массив);

	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказКлиента));

	ШаблонНазначения = Документы.ЗаказКлиента.ШаблонНазначения(ЭтотОбъект);

	РеквизитыДляПроверкиНазначения = "НаправлениеДеятельности,Договор,Партнер";
	Справочники.Назначения.ПроверитьЗаполнитьПередЗаписью(Назначение, ШаблонНазначения, ЭтотОбъект, РеквизитыДляПроверкиНазначения, Отказ);

	НоменклатураПартнеровСервер.ЗаполнитьНоменклатуруПартнераПоНоменклатуреВТаблице(Товары, Партнер);
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		НоменклатураПартнеровСервер.ЗаполнитьПустоеСопоставлениеВНоменклатуреПартнераПоНоменклатуреИБ(Товары, Отказ);
	КонецЕсли;

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОбщегоНазначенияУТ.ЗаполнитьИдентификаторыДокумента(ЭтотОбъект, Метаданные.Документы.ЗаказКлиента.ТабличныеЧасти.Товары.Имя);
	КонецЕсли;

	ЗаказКлиентаЛокализация.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

	Если ЭтоНовый() И Не ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
    #Вставка
	//29,02,24
	// Альтер ЛОГО+
	ПроверитьЗаполнениеСкладовВТабличнойЧастиТовары();

	//гтс заполняем сумму отменено  21.05.2019
	ЗаполнитьСуммуОтменено();
	//ASP__A.Zhel 11.04.2019
	Если НЕ Отказ И Статус <> Перечисления.СтатусыЗаказовКлиентов.Закрыт И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		РассчитатьСрокиРезервирования(РежимПроведения);	
	КонецЕсли;
	//__ASP
	ASP_ПоискОдинаковыхКодовСтроки();//ASP_Dante 12/08/19
	#КонецВставки
КонецПроцедуры
